// Пiдключаємо модуль express до node.js.

var express = require('express');

// Створюємо константу, в якiй буде мiститися порт локального серверу.
const port = 8080;

// Створюємо змiнну, що буде мiстити программу експрес.
var app = express();

// Створюємо локальний сервер, передамаємо у функцiю аргументи запиту та результату.
app.get('/', function(req, res) {
	// Вiдправляємо на локальний сервер файли.
  res.sendfile('Заголовок.html');
});
// Отримаємо порт, та запустимо сервер.
app.listen(port);
// Виводимо в консоль порт локального серверу, для того, щоб переконатися, що вiн працює.
console.log('Порт:' + port);